<template>
  <DialogBase :visible.sync="visible" :showFooter="false" width="900px" title="《第三方配送协议》">
    <div class="content">
      <h3>一、总则</h3>
      <p>1.1 本协议为您（即商户）与中企动力科技股份有限公司（以下简称“中企”）就商品配送服务达成的协议，请您务必审慎阅读、充分理解各条款内容，请特别注意涉及免除或者限制中企责任的免责条款，对商户的权利限制的条款，法律适用、争议解决方式的条款。</p>
      <p>1.2 除非您接受本协议的所有条款，否则您无权使用本协议项下的相关服务。您的登录、使用等行为即表明您同意接受本协议的约束。</p>
      <p>1.3 本协议内容同时包括本协议后续的更新、中企未来发布的关于本协议的相关协议、服务声明、业务规则等内容。在本协议及具体规则内容生效后您继续配送服务的，视为您已接受修改后的协议，若您不同意修改后的协议内容，请立即停止使用配送服务。</p>
      <h3>二、定义</h3>
      <p>2.1 用户：在商户的微信公众号上购买商品并要求提供配送服务，具有完全民事权利能力和行为能力的自然人。</p>
      <p>2.2 商户：即本协议中的“您”，是指购买中企软件后在中企后台接受用户配送需求，为用户提供配送服务的法人或组织。</p>
      <h3>三、服务内容</h3>
      <p>3.1 本协议约定的配送服务将由第三方服务商为您提供服务。您可以通过中企移动商城的后台去查询订单管理服务、配送查询服务等，包括确定是否接单、查询下单时间、配送团队、配送状态、结算状态等。</p>
      <p>3.2 用户可以在中企后台查询已下单商品的配送信息，包括查询配送方式、配送进度等。</p>
      <h3>四、中企权利义务</h3>
      <p>4.1 中企有权对您在中企平台发布的信息进行审核，必要时可做屏蔽或删除处理。</p>
      <p>4.2 若您店铺内所售商品违反法律法规规定的，中企有权按照相关规定对您进行处罚，并举报至相关行政主管部门。</p>
      <p>4.3 如用户向中企投诉，经中企核实情况属实后，中企有权要求您配合解决该投诉。如出现不符合法律法规、政策规定或侵犯第三方合法权益的内容的，中企有权在不通知您的情况下做下线处理。</p>
      <p>4.4 中企有权按法律法规规定保存您的资质信息、商品信息、交易记录等相关资料。</p>
      <h3>五、商户权利义务</h3>
      <p>5.1 您向用户提供的配送商品应当包含商品的具体信息和详细说明，并且应确保送达用户的商品与页面描述一致且质量合格。</p>
      <p>5.2 您应保证自身具备履行本协议及第三方服务商的配送规则项下义务的资质、管理制度及人员。</p>
      <p>5.3 如用户要求提供发票，由您负责全额提供。中企平台系统通知您用户下单信息后，如您因商品售罄等原因不能提供的，您应立即电话通知下单信息的用户和中企，并做好合理的安抚和处理措施，如因此造成用户投诉、经济损失等相关后果均由您承担。</p>
      <p>5.4 若您的商品存在质量或安全问题造成用户投诉、索赔、经济损失等相关后果均由您承担，如中企基于前述情况向消费者先行赔付的，中企有权向您追偿，追偿方式包括但不限于在结算给您的相关款项中直接扣除该赔付金额。</p>
      <p>5.5 您承诺在使用配送服务时不会出现以下违规行为，如因出现以下违规行为导致任何法律后果的发生，由您自行承担所有法律责任：</p>
      <p>5.5.1 违反国家法律、法规要求以及各种社会公共利益或公共道德的行为； </p>
      <p>5.5.2 违反中企或第三方服务商相关规定的行为（包括但不限于制造虚假订单、利用系统漏洞获取利润、违规套现、对用户消费欺诈、无故取消订单、无故拒绝配送等）； </p>
      <p>5.5.3 其他损害中企、用户和其他商户利益的行为。</p>
      <h3>六、配送费用</h3>
      <p>6.1 本配送由第三方服务商为您提供服务，目前有多家配送团队，具体配送内容及相关的配送规则，您同意您将按照您选择的第三方服务商具体配送服务提供商的官网规则及配送规则并严格遵照执行。</p>
      <p>6.2 当您确认使用配送服务后，您将获得一个第三方服务商提供的虚拟账户用来支付配送费用。您可以在商城后台或是第三方后台进行费用充值。充值的配送费用会直接支付到第三方服务商的账户名下，如您后期需要开具发票或其他服务支持时可直接进入第三方官网后台去咨询售后顾问。如因您费用充值及发票事宜产生的纠纷和争议，由您和第三方服务商沟通处理，与中企无关。</p>
      <p>6.3 当您在第三方服务商的配送账户余额低于配送价时，将无法进行下单，请及时进行充值。</p>
      <p>6.4 如您以后不再使用第三方配送时，预充值的金额将不予退还</p>
      <p>6.5 甲方同意、确认并承诺，本配送协议中的配送服务均由第三方配送服务商为您提供相应服务，如在配送服务过程中发生的任何争议和纠纷，您应向第三方服务商主张。如因您违法第三方服务商相关规则的，应由您自行承担相关后果，与中企无关；如因第三方服务商未按照其官网或配送规则约定履行导致的您的服务权益受损或不能实现或不完全实现的，您亦应当直接向第三方服务商主张，与中企无关。</p>
      <h3>七、特别约定</h3>
      <p>7.1 各类商品所需配送时间按照相应规则。</p>
      <p>7.2 当配送商品出现破损时找到第三方配送平台投诉，您同意第三方有权介入处理该问题。且第三方平台将分别组织您与用户提交相关证据材料对该事件进行判定，若判定商品破损是由于配送员配送不当造成的，由商品破损给用户造成的损失由第三方平台进行赔付；若商品破损是由于您的原因（包括商品既有问题、商品包装不当）造成的，给用户造成的损失由您承担。若您未及时对用户进行赔付的，您同意第三方配送平台有权暂时从您的预存款里扣除该笔费用。</p>
      <p>7.3 对于异常事件的证据材料，中企和您都应做好妥善保存工作。</p>
      <h3>八、保密条款</h3>
      <p>8.1 未经您的同意或授权，除应国家机关要求外，中企将会对您的资质文件、商业秘密采取严格的保密措施，保密程度不低于相关法律法规规定。</p>
      <p>8.2 本保密义务在双方合作终止两年后终止。</p>
      <h3>九、知识产权</h3>
      <p>9.1 双方的知识产权归各自所有。一方均不可在对方未经授权的情况下使用对方名称、Logo以及涉及相关内容的销售、促销宣传材料及广告、报纸、杂志、宣传单等，如因此产生的所有不良后果及损失由违约方全部承担。</p>
      <p>9.2 除另有特别声明外，中企提供本服务时所依托软件的著作权、专利权及其他知识产权均归中企所有。</p>
      <h3>十、风险和免责</h3>
      <p>10.1 中企不对由于互联网正常的设备维护、电力故障、黑客攻击、病毒侵袭、罢工、暴乱起义、骚乱、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。</p>
      <h3>十一、法律责任</h3>
      <p>11.1 本协议任何一方均应对其获得的对方的业务、经营、财务状况和其他保密资料予以严格保密，不得以任何形式向任何第三方披露。如因任何一方未能履行保密义务而给其他方造成任何损失的，应承担赔偿责任。</p>
      <p>11.2 您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；中企因此遭受损失的，您也应当一并赔偿。</p>
      <h3>十二、法律适用、管辖及其他</h3>
      <p>12.1 本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国大陆地区法律，如无相关法律规定的，则应参照通用国际商业惯例和（或）行业惯例。 </p>
      <p>12.2 因本协议所引起或与其有关的任何争议应向中企所在地北京市大兴区人民法院提起诉讼。</p>
      <p>12.3 本协议取代您和中企先前就相同事项订立的任何书面或口头协议。倘若本协议任何条款被裁定为无效或不可强制执行，该项条款应被撤销，而其余条款应予遵守和执行。条款标题仅为方便参阅而设，并不以任何方式界定、限制、解释或描述该条款的范围或限度。</p>
    </div>
  </DialogBase>
</template>
<script>
import DialogBase from "@/components/DialogBase";

export default {
  data() {
    return {
      showFooter: false,
      activeName: "h5"
    };
  },
  components: {
    DialogBase
  },
  methods: {
    close() {
      this.$emit("isClose");
    }
  },
  computed: {
    visible: {
      get() {
        return this.dialogVisible;
      },
      set(val) {
        this.$emit("update:dialogVisible", val);
      }
    }
  },
  props: {
    data: {},
    dialogVisible: {
      type: Boolean,
      required: true
    }
  }
};
</script>
<style lang="scss" scoped>
.content {
  height: 500px;
  overflow: auto;
  &::-webkit-scrollbar {
    width: 6px;
    height: 8px;
  }
  &::-webkit-scrollbar-thumb {
    border-radius: 10px !important;
    background: #D2D2DC !important;
  }
  &::-webkit-scrollbar-track {
    border-radius: 0 !important;
    background: #D2D2DC !important;
  }
  p {
    font-size: 14px;
    color: #44434b;
    line-height: 24px;
  }
  h3 {
     font-weight: 600;
     font-size: 14px;
     padding: 12px 0;
  }
}
</style>


